3B/CS343/src/03-Coroutine.org
#+title: Coroutine
#+author: Arnav Gupta
#+LATEX_HEADER: \usepackage{parskip,darkmode}
#+LATEX_HEADER: \enabledarkmode
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="src/latex.css" />

* Coroutine
A routine that can also be suspended at some point and resumed from that point when control returns.

State of a coroutine consists of:
- *execution location* starting at the beginning of the coroutine and remembered at each suspend
- *execution state* holding the data created by the code the coroutine is executing (coroutine stack)
- *execution status* (active/inactive/terminated) changes as control resumes and suspends in a coroutine

Coroutine is activated at the point of last suspension.

Couroutines allow for retaining state between calls (like a finite state machine) and execute
synchronously with other coroutines.

* Semi-Coroutine
Acts asymmetrically by implicitly reactivating the coroutine that previously activated it.

~_Coroutine~ wraps coroutine and provides all class properties:
- distinguished member ~main~ can be suspended and resumed (usually private or protected)
- no parameters or return value (supplied by public members and communication variables)

All coroutines inherit from the base type ~uBaseCoroutine~.
#+BEGIN_SRC cpp
class uBaseCoroutine {
    protected:
        void resume(); // context switch to this
        void suspend(); // context switch to last resumer
        virtual void main() = 0; // starting routine for coroutine
    private:
        uBaseCoroutine();
        uBaseCoroutine( unsigned int stackSize ); // set stack size
        void verify(); // check stack
        const char * setName( const char * name ); // printed in error messages
        const char * getName() const;
        uBaseCoroutine & starter() const; // coroutine performing first resume
        uBaseCoroutine & resumer() const; // coroutine performing last resume
}
#+END_SRC

Resume/suspend causes a context switch between coroutine stacks:
- first ~resume~ starts main on new stack, subsequent resumes reactivate the last ~suspend~
- ~suspend~ reactivates the last resumer
- routine frame at the top of the stack knows where to activate execution
- ~suspend~ and ~resume~ are protected members to prevent external calls to give more control over
  how these are called to the coroutine developer

When deleted, a coroutine's stack is always unwound and any destructors are executed.

Cannot use ~catch( ... )~ in a coroutine if it may be deleted before terminating, since a cleanup
exception is raised to force stack unwinding.

~resume~ in constructor allows coroutine main to get to first suspend.

*** Correct Coroutine Usage
Eliminate computation or flag variables retaining information about execution state.
Instead, let the coroutine do that work.

To convert a direct program to a coroutine:
1. put processing code into coroutine main
2. convert reads if program is consuming or writes if program is producing to suspend
3. use interface members and communication variables to transfer data in and out of coroutine

* \mu{}C++ EHM
Supports throw and resume for raising, and termination and resumption for handling.

Supports propagation of nonlocal and concurrent exceptions.

All exception types are grouped into a hierarchy.

