3B/CS343/03-Coroutine.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-10-26 Sat 23:37 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Coroutine</title>
<meta name="author" content="Arnav Gupta" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="src/latex.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Coroutine</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org75696be">1. Coroutine</a></li>
<li><a href="#org685cacc">2. Semi-Coroutine</a>
<ul>
<li>
<ul>
<li><a href="#org9bb2087">2.0.1. Correct Coroutine Usage</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org22f9392">3. &mu;C++ EHM</a></li>
<li><a href="#orge9a5fae">4. Exception Type</a></li>
<li><a href="#orgd3d4f91">5. Inherited Members</a></li>
<li><a href="#org62e338f">6. Raising</a></li>
<li><a href="#org32c3eae">7. Handler</a>
<ul>
<li><a href="#orge0db814">7.1. Resumption</a></li>
<li><a href="#orgbaef960">7.2. Termination/Resumption</a></li>
<li><a href="#org3586294">7.3. Object Binding</a></li>
<li><a href="#org3c47eeb">7.4. Bound Handlers</a></li>
</ul>
</li>
<li><a href="#org5817280">8. Nonlocal Exceptions</a></li>
<li><a href="#org6aa67c2">9. Memory Management</a></li>
<li><a href="#orgf6af74b">10. Full Coroutine</a></li>
<li><a href="#orgb7cf2d1">11. Coroutine Languages</a></li>
</ul>
</div>
</div>
<div id="outline-container-org75696be" class="outline-2">
<h2 id="org75696be"><span class="section-number-2">1.</span> Coroutine</h2>
<div class="outline-text-2" id="text-1">
<p>
A routine that can also be suspended at some point and resumed from that point when control returns.
</p>

<p>
State of a coroutine consists of:
</p>
<ul class="org-ul">
<li><b>execution location</b> starting at the beginning of the coroutine and remembered at each suspend</li>
<li><b>execution state</b> holding the data created by the code the coroutine is executing (coroutine stack)</li>
<li><b>execution status</b> (active/inactive/terminated) changes as control resumes and suspends in a coroutine</li>
</ul>

<p>
Coroutine is activated at the point of last suspension.
</p>

<p>
Couroutines allow for retaining state between calls (like a finite state machine) and execute
synchronously with other coroutines.
</p>
</div>
</div>
<div id="outline-container-org685cacc" class="outline-2">
<h2 id="org685cacc"><span class="section-number-2">2.</span> Semi-Coroutine</h2>
<div class="outline-text-2" id="text-2">
<p>
Acts asymmetrically by implicitly reactivating the coroutine that previously activated it.
</p>

<p>
<code>_Coroutine</code> wraps coroutine and provides all class properties:
</p>
<ul class="org-ul">
<li>distinguished member <code>main</code> can be suspended and resumed (usually private or protected)</li>
<li>no parameters or return value (supplied by public members and communication variables)</li>
</ul>

<p>
All coroutines inherit from the base type <code>uBaseCoroutine</code>.
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">uBaseCoroutine</span> <span style="color: #51afef;">{</span>
    <span style="color: #51afef;">protected</span>:
        <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">resume</span><span style="color: #c678dd;">()</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">context switch to this</span>
        <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">suspend</span><span style="color: #c678dd;">()</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">context switch to last resumer</span>
        <span style="color: #51afef;">virtual</span> <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">main</span><span style="color: #c678dd;">()</span> = <span style="color: #da8548; font-weight: bold;">0</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">starting routine for coroutine</span>
    <span style="color: #51afef;">private</span>:
        <span style="color: #c678dd;">uBaseCoroutine</span><span style="color: #c678dd;">()</span>;
        <span style="color: #c678dd;">uBaseCoroutine</span><span style="color: #c678dd;">(</span> <span style="color: #ECBE7B;">unsigned</span> <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">stackSize</span> <span style="color: #c678dd;">)</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">set stack size</span>
        <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">verify</span><span style="color: #c678dd;">()</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">check stack</span>
        <span style="color: #51afef;">const</span> <span style="color: #ECBE7B;">char</span> * <span style="color: #c678dd;">setName</span><span style="color: #c678dd;">(</span> <span style="color: #51afef;">const</span> <span style="color: #ECBE7B;">char</span> * <span style="color: #dcaeea;">name</span> <span style="color: #c678dd;">)</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">printed in error messages</span>
        <span style="color: #51afef;">const</span> <span style="color: #ECBE7B;">char</span> * <span style="color: #c678dd;">getName</span><span style="color: #c678dd;">()</span> <span style="color: #51afef;">const</span>;
        <span style="color: #ECBE7B;">uBaseCoroutine</span> &amp; <span style="color: #c678dd;">starter</span><span style="color: #c678dd;">()</span> <span style="color: #51afef;">const</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">coroutine performing first resume</span>
        <span style="color: #ECBE7B;">uBaseCoroutine</span> &amp; <span style="color: #c678dd;">resumer</span><span style="color: #c678dd;">()</span> <span style="color: #51afef;">const</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">coroutine performing last resume</span>
<span style="color: #51afef;">}</span>
</pre>
</div>

<p>
Resume/suspend causes a context switch between coroutine stacks:
</p>
<ul class="org-ul">
<li>first <code>resume</code> starts main on new stack, subsequent resumes reactivate the last <code>suspend</code></li>
<li><code>suspend</code> reactivates the last resumer</li>
<li>routine frame at the top of the stack knows where to activate execution</li>
<li><code>suspend</code> and <code>resume</code> are protected members to prevent external calls to give more control over
how these are called to the coroutine developer</li>
</ul>

<p>
When deleted, a coroutine&rsquo;s stack is always unwound and any destructors are executed.
</p>

<p>
Cannot use <code>catch( ... )</code> in a coroutine if it may be deleted before terminating, since a cleanup
exception is raised to force stack unwinding.
</p>

<p>
<code>resume</code> in constructor allows coroutine main to get to first suspend.
</p>
</div>
<div id="outline-container-org9bb2087" class="outline-4">
<h4 id="org9bb2087"><span class="section-number-4">2.0.1.</span> Correct Coroutine Usage</h4>
<div class="outline-text-4" id="text-2-0-1">
<p>
Eliminate computation or flag variables retaining information about execution state.
Instead, let the coroutine do that work.
</p>

<p>
To convert a direct program to a coroutine:
</p>
<ol class="org-ol">
<li>put processing code into coroutine main</li>
<li>convert reads if program is consuming or writes if program is producing to suspend</li>
<li>use interface members and communication variables to transfer data in and out of coroutine</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org22f9392" class="outline-2">
<h2 id="org22f9392"><span class="section-number-2">3.</span> &mu;C++ EHM</h2>
<div class="outline-text-2" id="text-3">
<p>
Supports throw and resume for raising, and termination and resumption for handling.
</p>

<p>
Supports propagation of nonlocal and concurrent exceptions.
</p>

<p>
All exception types are grouped into a hierarchy.
</p>
</div>
</div>
