3B/CS343/03-Coroutine.tex
% Created 2024-10-26 Sat 23:37
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{parskip,darkmode}
\enabledarkmode
\author{Arnav Gupta}
\date{\today}
\title{Coroutine}
\hypersetup{
 pdfauthor={Arnav Gupta},
 pdftitle={Coroutine},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.7.11)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Coroutine}
\label{sec:org9fa8f76}
A routine that can also be suspended at some point and resumed from that point when control returns.

State of a coroutine consists of:
\begin{itemize}
\item \textbf{execution location} starting at the beginning of the coroutine and remembered at each suspend
\item \textbf{execution state} holding the data created by the code the coroutine is executing (coroutine stack)
\item \textbf{execution status} (active/inactive/terminated) changes as control resumes and suspends in a coroutine
\end{itemize}

Coroutine is activated at the point of last suspension.

Couroutines allow for retaining state between calls (like a finite state machine) and execute
synchronously with other coroutines.
\section{Semi-Coroutine}
\label{sec:orgc1d8182}
Acts asymmetrically by implicitly reactivating the coroutine that previously activated it.

\texttt{\_Coroutine} wraps coroutine and provides all class properties:
\begin{itemize}
\item distinguished member \texttt{main} can be suspended and resumed (usually private or protected)
\item no parameters or return value (supplied by public members and communication variables)
\end{itemize}

All coroutines inherit from the base type \texttt{uBaseCoroutine}.
\begin{verbatim}
class uBaseCoroutine {
    protected:
        void resume(); // context switch to this
        void suspend(); // context switch to last resumer
        virtual void main() = 0; // starting routine for coroutine
    private:
        uBaseCoroutine();
        uBaseCoroutine( unsigned int stackSize ); // set stack size
        void verify(); // check stack
        const char * setName( const char * name ); // printed in error messages
        const char * getName() const;
        uBaseCoroutine & starter() const; // coroutine performing first resume
        uBaseCoroutine & resumer() const; // coroutine performing last resume
}
\end{verbatim}

Resume/suspend causes a context switch between coroutine stacks:
\begin{itemize}
\item first \texttt{resume} starts main on new stack, subsequent resumes reactivate the last \texttt{suspend}
\item \texttt{suspend} reactivates the last resumer
\item routine frame at the top of the stack knows where to activate execution
\item \texttt{suspend} and \texttt{resume} are protected members to prevent external calls to give more control over
how these are called to the coroutine developer
\end{itemize}

When deleted, a coroutine's stack is always unwound and any destructors are executed.

Cannot use \texttt{catch( ... )} in a coroutine if it may be deleted before terminating, since a cleanup
exception is raised to force stack unwinding.

\texttt{resume} in constructor allows coroutine main to get to first suspend.
\subsubsection{Correct Coroutine Usage}
\label{sec:org2c3e00d}
Eliminate computation or flag variables retaining information about execution state.
Instead, let the coroutine do that work.

To convert a direct program to a coroutine:
\begin{enumerate}
\item put processing code into coroutine main
\item convert reads if program is consuming or writes if program is producing to suspend
\item use interface members and communication variables to transfer data in and out of coroutine
\end{enumerate}
\section{\(\mu\)C++ EHM}
\label{sec:orgec67700}
Supports throw and resume for raising, and termination and resumption for handling.

Supports propagation of nonlocal and concurrent exceptions.

All exception types are grouped into a hierarchy.
