3B/CS343/src/03-Coroutine.org
* Exception Type
\mu{}C++ restricts exception types to those defined by ~_Exception~.
All ~_Exception~ types must have public default and copy constructor.

* Inherited Members
Each exception type inherits the following from ~uBaseEvent~:
#+BEGIN_SRC cpp
class uBaseEvent {
    uBaseEvent( const char *const msg = "" );
    const char *const message() const; // returns string message
    const uBaseCoroutine &source() const; // returns coroutine/task that raised exception
    const char *sourceName() const; // returns name of coroutine/task that raised exception
    virtual void defaultTerminate(); // called if an exception is thrown but not handled
    virtual void defaultResume(); // called if an exception is resumed but not handled
}
#+END_SRC

~msg~ is printed if the exception is not caught (string copied, so safe to use even if context
of the raise is deleted).

Coroutine/task may be deleted when the exception is caught so ~source~ can return an undefined
reference, but ~sourceName~ copies the name, so that will be defined.

~defaultTerminate~ usually forwards an ~UnhandledException~ to the resumer/joiner.
~defaultResume~ usually throws the exception.

* Raising
Can throw and resume with ~_Throw~ and ~_Resume~ respectively.
If no exception type is passed, they are rethrows and reresumes respectively.

~_Resume~ has an optional ~_At~ clause that allows the specified exception or currently propagating
exception to be raised at another coroutine/task.

Only resumption allows nonlocal raise since raising execution state is often unaware of the handler's
execution state.
Resumption allows the faulting execution choose if it can process the exception as resumption or
rethrow the exception for termination.

In \mu{}C++, handlers can catch the specific derived exception type (rather than base).

* Handler
** Resumption
Using ~_CatchResume~ after a ~try~ body handle resumption, however these must precede ~catch~ handlers.

A resumption handler can access types and variables visible in its local scope.

*Lexical link* gives access to declaration block.

Resumption handler cannot perform a ~break~, ~continue~, ~goto~, or ~return~.

If correction is impossible from resumption, the handler should throw an exception rather than
breaking to cause the stack to unwind correctly.

** Termination/Resumption
Exception types for termination and resumption can overlap.
That is, ~catch~ and ~_CatchResume~ can have the same exception type.
Then, the termination handler is called if the resumption handler throws.

If no resumption handler exists, ~defaultResume~ is called which throws anyways.

** Object Binding
~_Resume~ and ~_Throw~ implicitly store the ~this~ associated with the member raising an exception.

For a static member or free routine, there is no binding.
For a non-local raise, the binding is the coroutine/task executing the raise.

** Bound Handlers
When a raising object is specified in a handler, an exception is caught when the bound and handler
objects are equal and the raised exception equals the handler exception or its base type.

