3B/CS343/03-Coroutine.html
<div id="outline-container-orge9a5fae" class="outline-2">
<h2 id="orge9a5fae"><span class="section-number-2">4.</span> Exception Type</h2>
<div class="outline-text-2" id="text-4">
<p>
&mu;C++ restricts exception types to those defined by <code>_Exception</code>.
All <code>_Exception</code> types must have public default and copy constructor.
</p>
</div>
</div>
<div id="outline-container-orgd3d4f91" class="outline-2">
<h2 id="orgd3d4f91"><span class="section-number-2">5.</span> Inherited Members</h2>
<div class="outline-text-2" id="text-5">
<p>
Each exception type inherits the following from <code>uBaseEvent</code>:
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">uBaseEvent</span> <span style="color: #51afef;">{</span>
    <span style="color: #c678dd;">uBaseEvent</span><span style="color: #c678dd;">(</span> <span style="color: #51afef;">const</span> <span style="color: #ECBE7B;">char</span> *<span style="color: #51afef;">const</span> <span style="color: #dcaeea;">msg</span> = <span style="color: #98be65;">""</span> <span style="color: #c678dd;">)</span>;
    <span style="color: #51afef;">const</span> <span style="color: #ECBE7B;">char</span> *<span style="color: #51afef;">const</span> <span style="color: #c678dd;">message</span><span style="color: #c678dd;">()</span> <span style="color: #51afef;">const</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">returns string message</span>
    <span style="color: #51afef;">const</span> <span style="color: #ECBE7B;">uBaseCoroutine</span> &amp;<span style="color: #c678dd;">source</span><span style="color: #c678dd;">()</span> <span style="color: #51afef;">const</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">returns coroutine/task that raised exception</span>
    <span style="color: #51afef;">const</span> <span style="color: #ECBE7B;">char</span> *<span style="color: #c678dd;">sourceName</span><span style="color: #c678dd;">()</span> <span style="color: #51afef;">const</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">returns name of coroutine/task that raised exception</span>
    <span style="color: #51afef;">virtual</span> <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">defaultTerminate</span><span style="color: #c678dd;">()</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">called if an exception is thrown but not handled</span>
    <span style="color: #51afef;">virtual</span> <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">defaultResume</span><span style="color: #c678dd;">()</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">called if an exception is resumed but not handled</span>
<span style="color: #51afef;">}</span>
</pre>
</div>

<p>
<code>msg</code> is printed if the exception is not caught (string copied, so safe to use even if context
of the raise is deleted).
</p>

<p>
Coroutine/task may be deleted when the exception is caught so <code>source</code> can return an undefined
reference, but <code>sourceName</code> copies the name, so that will be defined.
</p>

<p>
<code>defaultTerminate</code> usually forwards an <code>UnhandledException</code> to the resumer/joiner.
<code>defaultResume</code> usually throws the exception.
</p>
</div>
</div>
<div id="outline-container-org62e338f" class="outline-2">
<h2 id="org62e338f"><span class="section-number-2">6.</span> Raising</h2>
<div class="outline-text-2" id="text-6">
<p>
Can throw and resume with <code>_Throw</code> and <code>_Resume</code> respectively.
If no exception type is passed, they are rethrows and reresumes respectively.
</p>

<p>
<code>_Resume</code> has an optional <code>_At</code> clause that allows the specified exception or currently propagating
exception to be raised at another coroutine/task.
</p>

<p>
Only resumption allows nonlocal raise since raising execution state is often unaware of the handler&rsquo;s
execution state.
Resumption allows the faulting execution choose if it can process the exception as resumption or
rethrow the exception for termination.
</p>

<p>
In &mu;C++, handlers can catch the specific derived exception type (rather than base).
</p>
</div>
</div>
<div id="outline-container-org32c3eae" class="outline-2">
<h2 id="org32c3eae"><span class="section-number-2">7.</span> Handler</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orge0db814" class="outline-3">
<h3 id="orge0db814"><span class="section-number-3">7.1.</span> Resumption</h3>
<div class="outline-text-3" id="text-7-1">
<p>
Using <code>_CatchResume</code> after a <code>try</code> body handle resumption, however these must precede <code>catch</code> handlers.
</p>

<p>
A resumption handler can access types and variables visible in its local scope.
</p>

<p>
<b>Lexical link</b> gives access to declaration block.
</p>

<p>
Resumption handler cannot perform a <code>break</code>, <code>continue</code>, <code>goto</code>, or <code>return</code>.
</p>

<p>
If correction is impossible from resumption, the handler should throw an exception rather than
breaking to cause the stack to unwind correctly.
</p>
</div>
</div>
<div id="outline-container-orgbaef960" class="outline-3">
<h3 id="orgbaef960"><span class="section-number-3">7.2.</span> Termination/Resumption</h3>
<div class="outline-text-3" id="text-7-2">
<p>
Exception types for termination and resumption can overlap.
That is, <code>catch</code> and <code>_CatchResume</code> can have the same exception type.
Then, the termination handler is called if the resumption handler throws.
</p>

<p>
If no resumption handler exists, <code>defaultResume</code> is called which throws anyways.
</p>
</div>
</div>
<div id="outline-container-org3586294" class="outline-3">
<h3 id="org3586294"><span class="section-number-3">7.3.</span> Object Binding</h3>
<div class="outline-text-3" id="text-7-3">
<p>
<code>_Resume</code> and <code>_Throw</code> implicitly store the <code>this</code> associated with the member raising an exception.
</p>

<p>
For a static member or free routine, there is no binding.
For a non-local raise, the binding is the coroutine/task executing the raise.
</p>
</div>
</div>
<div id="outline-container-org3c47eeb" class="outline-3">
<h3 id="org3c47eeb"><span class="section-number-3">7.4.</span> Bound Handlers</h3>
<div class="outline-text-3" id="text-7-4">
<p>
When a raising object is specified in a handler, an exception is caught when the bound and handler
objects are equal and the raised exception equals the handler exception or its base type.
</p>
</div>
</div>
</div>
