3B/CS343/03-Coroutine.tex
\section{Exception Type}
\label{sec:org160477f}
\(\mu\)C++ restricts exception types to those defined by \texttt{\_Exception}.
All \texttt{\_Exception} types must have public default and copy constructor.
\section{Inherited Members}
\label{sec:orgf1c346f}
Each exception type inherits the following from \texttt{uBaseEvent}:
\begin{verbatim}
class uBaseEvent {
    uBaseEvent( const char *const msg = "" );
    const char *const message() const; // returns string message
    const uBaseCoroutine &source() const; // returns coroutine/task that raised exception
    const char *sourceName() const; // returns name of coroutine/task that raised exception
    virtual void defaultTerminate(); // called if an exception is thrown but not handled
    virtual void defaultResume(); // called if an exception is resumed but not handled
}
\end{verbatim}

\texttt{msg} is printed if the exception is not caught (string copied, so safe to use even if context
of the raise is deleted).

Coroutine/task may be deleted when the exception is caught so \texttt{source} can return an undefined
reference, but \texttt{sourceName} copies the name, so that will be defined.

\texttt{defaultTerminate} usually forwards an \texttt{UnhandledException} to the resumer/joiner.
\texttt{defaultResume} usually throws the exception.
\section{Raising}
\label{sec:org51063d3}
Can throw and resume with \texttt{\_Throw} and \texttt{\_Resume} respectively.
If no exception type is passed, they are rethrows and reresumes respectively.

\texttt{\_Resume} has an optional \texttt{\_At} clause that allows the specified exception or currently propagating
exception to be raised at another coroutine/task.

Only resumption allows nonlocal raise since raising execution state is often unaware of the handler's
execution state.
Resumption allows the faulting execution choose if it can process the exception as resumption or
rethrow the exception for termination.

In \(\mu\)C++, handlers can catch the specific derived exception type (rather than base).
\section{Handler}
\label{sec:org3a6eed5}
\subsection{Resumption}
\label{sec:org9e1e2b3}
Using \texttt{\_CatchResume} after a \texttt{try} body handle resumption, however these must precede \texttt{catch} handlers.

A resumption handler can access types and variables visible in its local scope.

\textbf{Lexical link} gives access to declaration block.

Resumption handler cannot perform a \texttt{break}, \texttt{continue}, \texttt{goto}, or \texttt{return}.

If correction is impossible from resumption, the handler should throw an exception rather than
breaking to cause the stack to unwind correctly.
\subsection{Termination/Resumption}
\label{sec:org0ec686c}
Exception types for termination and resumption can overlap.
That is, \texttt{catch} and \texttt{\_CatchResume} can have the same exception type.
Then, the termination handler is called if the resumption handler throws.

If no resumption handler exists, \texttt{defaultResume} is called which throws anyways.
\subsection{Object Binding}
\label{sec:org985291a}
\texttt{\_Resume} and \texttt{\_Throw} implicitly store the \texttt{this} associated with the member raising an exception.

For a static member or free routine, there is no binding.
For a non-local raise, the binding is the coroutine/task executing the raise.
\subsection{Bound Handlers}
\label{sec:org62822b0}
When a raising object is specified in a handler, an exception is caught when the bound and handler
objects are equal and the raised exception equals the handler exception or its base type.
