3B/CS343/src/03-Coroutine.org
* Nonlocal Exceptions
Exceptions raised by a source execution at a faulting execution, possible because each coroutine has
its own stack.

Nonlocal resumption becomes a local resumption in the faulting coroutine.
The source delivers a nonlocal exception immediately, but propagation only occurs when faulting becomes
active, so that must be resumed.

The faulting coroutine checks for nonlocal exceptions around ~_Enable~, ~suspend~, and ~resume~.
The handler then returns to the implicit local raise.

Multiple nonlocal exceptions are queued and delivered in FIFO order depending on the
current enabled exceptions.

Nonlocal delivery is initially _disabled_ for a coroutine so this must be explicitly enabled
with ~_Enable~.

An unhandled exception in a coroutine raises a nonlocal exception of type
~uBaseCoroutine::UnhandledException~ at the coroutine's _last resumer_ and then terminates the coroutine.

Exception forwarding can occur accross any number of coroutines until a task main forwards and then
the program terminates by calling main's ~set_terminate~.

The original exception is in the ~UnhandledException~ exception and can be thrown by ~uh.triggerCause()~.
If the original exception has a ~defaultTerminate~ routine, that will override ~UnhandledException~.

While the coroutine terminates, control returns to its last resumer rather than its starter.

~UnhandledException~ is always enabled.

* Memory Management
Coroutine stacks expand to the next stack, rather than the heap.

Default \mu{}C++ coroutine stack size 256K and does not grow, but it can be adjusted through
the coroutine constructor.

Sometimes better to allocate large arrays in heap when in coroutine main, due to stack size.

* Full Coroutine
Acts symmetrically by explicitly activating a member of another coroutine which directly or indirectly
activates the original coroutine (activation cycle).

A full coroutine can perform semi-coroutine operations since it subsumes a semi-coroutine.

Suspend inactivates the current active coroutine and activates the last resumer.
Resume inactivates the current active coroutine and activates the current object (~this~).
Hence, the current object must be a non-terminated coroutine.

The last resumer is not changed when resuming self.

Phases to any full coroutine program:
1. starting the cycle
2. executing the cycle
3. stopping the cycle (returning to program main)

Starting the cycle requires each coroutine to know at least one other coroutine, but this can
cause mutually recursive references.

Note that a coroutine should go back to its starter. For full coroutines, the starter is often
not the last resumer, so coroutine main does not appear to implicitly ~suspend~ on termination.
The starter stack always gets back to program main.

* Coroutine Languages
Coroutine implementations can be:
- *stackless*: use the caller's stack and fixed-size local state
  - cannot call other routines and then suspend
  - generators and iterators using ~yield~
- *stackful*: separate stack and a fixed-size local state (from a class)
