3B/CS343/03-Coroutine.html
<div id="outline-container-org5817280" class="outline-2">
<h2 id="org5817280"><span class="section-number-2">8.</span> Nonlocal Exceptions</h2>
<div class="outline-text-2" id="text-8">
<p>
Exceptions raised by a source execution at a faulting execution, possible because each coroutine has
its own stack.
</p>

<p>
Nonlocal resumption becomes a local resumption in the faulting coroutine.
The source delivers a nonlocal exception immediately, but propagation only occurs when faulting becomes
active, so that must be resumed.
</p>

<p>
The faulting coroutine checks for nonlocal exceptions around <code>_Enable</code>, <code>suspend</code>, and <code>resume</code>.
The handler then returns to the implicit local raise.
</p>

<p>
Multiple nonlocal exceptions are queued and delivered in FIFO order depending on the
current enabled exceptions.
</p>

<p>
Nonlocal delivery is initially <span class="underline">disabled</span> for a coroutine so this must be explicitly enabled
with <code>_Enable</code>.
</p>

<p>
An unhandled exception in a coroutine raises a nonlocal exception of type
<code>uBaseCoroutine::UnhandledException</code> at the coroutine&rsquo;s <span class="underline">last resumer</span> and then terminates the coroutine.
</p>

<p>
Exception forwarding can occur accross any number of coroutines until a task main forwards and then
the program terminates by calling main&rsquo;s <code>set_terminate</code>.
</p>

<p>
The original exception is in the <code>UnhandledException</code> exception and can be thrown by <code>uh.triggerCause()</code>.
If the original exception has a <code>defaultTerminate</code> routine, that will override <code>UnhandledException</code>.
</p>

<p>
While the coroutine terminates, control returns to its last resumer rather than its starter.
</p>

<p>
<code>UnhandledException</code> is always enabled.
</p>
</div>
</div>
<div id="outline-container-org6aa67c2" class="outline-2">
<h2 id="org6aa67c2"><span class="section-number-2">9.</span> Memory Management</h2>
<div class="outline-text-2" id="text-9">
<p>
Coroutine stacks expand to the next stack, rather than the heap.
</p>

<p>
Default &mu;C++ coroutine stack size 256K and does not grow, but it can be adjusted through
the coroutine constructor.
</p>

<p>
Sometimes better to allocate large arrays in heap when in coroutine main, due to stack size.
</p>
</div>
</div>
<div id="outline-container-orgf6af74b" class="outline-2">
<h2 id="orgf6af74b"><span class="section-number-2">10.</span> Full Coroutine</h2>
<div class="outline-text-2" id="text-10">
<p>
Acts symmetrically by explicitly activating a member of another coroutine which directly or indirectly
activates the original coroutine (activation cycle).
</p>

<p>
A full coroutine can perform semi-coroutine operations since it subsumes a semi-coroutine.
</p>

<p>
Suspend inactivates the current active coroutine and activates the last resumer.
Resume inactivates the current active coroutine and activates the current object (<code>this</code>).
Hence, the current object must be a non-terminated coroutine.
</p>

<p>
The last resumer is not changed when resuming self.
</p>

<p>
Phases to any full coroutine program:
</p>
<ol class="org-ol">
<li>starting the cycle</li>
<li>executing the cycle</li>
<li>stopping the cycle (returning to program main)</li>
</ol>

<p>
Starting the cycle requires each coroutine to know at least one other coroutine, but this can
cause mutually recursive references.
</p>

<p>
Note that a coroutine should go back to its starter. For full coroutines, the starter is often
not the last resumer, so coroutine main does not appear to implicitly <code>suspend</code> on termination.
The starter stack always gets back to program main.
</p>
</div>
</div>
<div id="outline-container-orgb7cf2d1" class="outline-2">
<h2 id="orgb7cf2d1"><span class="section-number-2">11.</span> Coroutine Languages</h2>
<div class="outline-text-2" id="text-11">
<p>
Coroutine implementations can be:
</p>
<ul class="org-ul">
<li><b>stackless</b>: use the caller&rsquo;s stack and fixed-size local state
<ul class="org-ul">
<li>cannot call other routines and then suspend</li>
<li>generators and iterators using <code>yield</code></li>
</ul></li>
<li><b>stackful</b>: separate stack and a fixed-size local state (from a class)</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arnav Gupta</p>
<p class="date">Created: 2024-10-26 Sat 23:37</p>
</div>
</body>
</html>
