3B/CS343/03-Coroutine.tex
\section{Nonlocal Exceptions}
\label{sec:org38719ca}
Exceptions raised by a source execution at a faulting execution, possible because each coroutine has
its own stack.

Nonlocal resumption becomes a local resumption in the faulting coroutine.
The source delivers a nonlocal exception immediately, but propagation only occurs when faulting becomes
active, so that must be resumed.

The faulting coroutine checks for nonlocal exceptions around \texttt{\_Enable}, \texttt{suspend}, and \texttt{resume}.
The handler then returns to the implicit local raise.

Multiple nonlocal exceptions are queued and delivered in FIFO order depending on the
current enabled exceptions.

Nonlocal delivery is initially \uline{disabled} for a coroutine so this must be explicitly enabled
with \texttt{\_Enable}.

An unhandled exception in a coroutine raises a nonlocal exception of type
\texttt{uBaseCoroutine::UnhandledException} at the coroutine's \uline{last resumer} and then terminates the coroutine.

Exception forwarding can occur accross any number of coroutines until a task main forwards and then
the program terminates by calling main's \texttt{set\_terminate}.

The original exception is in the \texttt{UnhandledException} exception and can be thrown by \texttt{uh.triggerCause()}.
If the original exception has a \texttt{defaultTerminate} routine, that will override \texttt{UnhandledException}.

While the coroutine terminates, control returns to its last resumer rather than its starter.

\texttt{UnhandledException} is always enabled.
\section{Memory Management}
\label{sec:org99c30f6}
Coroutine stacks expand to the next stack, rather than the heap.

Default \(\mu\)C++ coroutine stack size 256K and does not grow, but it can be adjusted through
the coroutine constructor.

Sometimes better to allocate large arrays in heap when in coroutine main, due to stack size.
\section{Full Coroutine}
\label{sec:org943d024}
Acts symmetrically by explicitly activating a member of another coroutine which directly or indirectly
activates the original coroutine (activation cycle).

A full coroutine can perform semi-coroutine operations since it subsumes a semi-coroutine.

Suspend inactivates the current active coroutine and activates the last resumer.
Resume inactivates the current active coroutine and activates the current object (\texttt{this}).
Hence, the current object must be a non-terminated coroutine.

The last resumer is not changed when resuming self.

Phases to any full coroutine program:
\begin{enumerate}
\item starting the cycle
\item executing the cycle
\item stopping the cycle (returning to program main)
\end{enumerate}

Starting the cycle requires each coroutine to know at least one other coroutine, but this can
cause mutually recursive references.

Note that a coroutine should go back to its starter. For full coroutines, the starter is often
not the last resumer, so coroutine main does not appear to implicitly \texttt{suspend} on termination.
The starter stack always gets back to program main.
\section{Coroutine Languages}
\label{sec:org1cfea94}
Coroutine implementations can be:
\begin{itemize}
\item \textbf{stackless}: use the caller's stack and fixed-size local state
\begin{itemize}
\item cannot call other routines and then suspend
\item generators and iterators using \texttt{yield}
\end{itemize}
\item \textbf{stackful}: separate stack and a fixed-size local state (from a class)
\end{itemize}
\end{document}
